CSCI112/Markdown/[02]lab-1.md

# Table of Contents

1.  [Lab #1](#orgbc0c073)
    1.  [Lab tasks](#orga5dca9d)
        1.  [Question 1: Make a square of astrics.](#orgc585fd1)
        2.  [Question 2: Find the product of two numbers.](#org49b1a5c)
        3.  [Question 3: Input two numbers and return the float sum and the integer sum.](#org992f715)


<a id="orgbc0c073"></a>

# Lab #1


<a id="orga5dca9d"></a>

## Lab tasks


<a id="orgc585fd1"></a>

### Question 1: Make a square of astrics.

```c    
#include <stdio.h>

int main() {

  int lim = 5;
  for (int x = 0; x < lim; x++) {

    for (int y = 0; y < lim; y++) {

      printf("*");
    }
    printf("\n");
  }
}
```

<a id="org49b1a5c"></a>

### Question 2: Find the product of two numbers.

```c
#include <stdio.h>

int main() {

  int a, b;

  printf("Enter the first number: "); scanf("%d", &a);
  printf("Enter the second number: "); scanf("%d", &b);
  printf("%d", (a * b));
}
```

<a id="org992f715"></a>

### Question 3: Input two numbers and return the float sum and the integer sum.

```c    
#include <stdio.h>

int main() {

  int a; float b;

  printf("Enter the first (int) number: "); scanf("%d", &a);
  printf("Enter the second (float) number: "); scanf("%f", &b);

  printf("Float output   -> %.2f\n", (a + b));
  printf("Integer output -> %d\n", (a + (int) b));

}
```
